In [1495]:
import pandas as pd
import re
import datetime
import numpy as np

In [1496]:
df = pd.read_csv('Invoice_20201220.csv',encoding='latin-1',sep= "|")

In [1497]:
df.shape

(51432, 6)

In [1498]:
df.head()

,SITE_NAME,INVOICE_NAME,BEGIN,END,KWH_PERIOD,PERIOD_EUR
0,12345_GEO (0001BB),1300082549,01/01/2018,31/01/2018,2 447,"316,46"
1,12345_GEO (0001BB),1300082549,01/02/2018,28/02/2018,2 211,"286,82"
2,12345_GEO (0001BB),1300082549,01/03/2018,31/03/2018,2 450,"317,32"
3,12345_GEO (0001BB),1300082549,01/04/2018,30/04/2018,2 431,"315,00"
4,12345_GEO (0001BB),1300082549,01/05/2018,31/05/2018,2 574,"333,37"

In [1499]:
df.tail()

,SITE_NAME,INVOICE_NAME,BEGIN,END,KWH_PERIOD,PERIOD_EUR
51427,19767_GEO (0632KO),FV1/055100030,30/08/2019,31/12/2019,3 028,"397,18"
51428,19767_GEO (0632KO),055100058,01/01/2020,31/03/2020,2 163,"283,57"
51429,19767_GEO (0632KO),055100113,01/04/2020,30/06/2020,2 160,"312,55"
51430,19767_GEO (0632KO),055100168,01/07/2020,30/09/2020,2 230,"294,07"
51431,19883_GEO (1203KO),7220278453,27/09/2019,31/12/2019,4 745,"681,96"

In [1500]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51432 entries, 0 to 51431
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   SITE_NAME     51432 non-null  object
 1   INVOICE_NAME  51432 non-null  object
 2   BEGIN         51432 non-null  object
 3   END           51432 non-null  object
 4   KWH_PERIOD    51432 non-null  object
 5   PERIOD_EUR    51432 non-null  object
dtypes: object(6)
memory usage: 2.4+ MB

#### 1) Le nom d'une antenne a un format bien précis : il est toujours composé de 4 chiffres et de deux lettres. On te demande de retirer tout autre caractère de la colonne "SITE_NAME".

In [1501]:
df['SITE_NAME'] =df['SITE_NAME'].str[-7:-1]

In [1502]:
df.head()

  SITE_NAME INVOICE_NAME       BEGIN         END KWH_PERIOD PERIOD_EUR
0    0001BB   1300082549  01/01/2018  31/01/2018      2 447     316,46
1    0001BB   1300082549  01/02/2018  28/02/2018      2 211     286,82
2    0001BB   1300082549  01/03/2018  31/03/2018      2 450     317,32
3    0001BB   1300082549  01/04/2018  30/04/2018      2 431     315,00
4    0001BB   1300082549  01/05/2018  31/05/2018      2 574     333,37

#### 2) On te demande de supprimer la colonne "INVOICE_NAME" qui n'apporte rien aux équipes.

In [1503]:
del df["INVOICE_NAME"]

In [1504]:
df.head()

  SITE_NAME       BEGIN         END KWH_PERIOD PERIOD_EUR
0    0001BB  01/01/2018  31/01/2018      2 447     316,46
1    0001BB  01/02/2018  28/02/2018      2 211     286,82
2    0001BB  01/03/2018  31/03/2018      2 450     317,32
3    0001BB  01/04/2018  30/04/2018      2 431     315,00
4    0001BB  01/05/2018  31/05/2018      2 574     333,37

#### 3) Il y a des antennes pour lesquelles on a des factures mensuelles tandis que pour d'autres, on les reçoit moins régulièrement (trimestre, semestre, année). Ajoute une colonne à ton tableau qui calcule le nombre de jours entre le début de la période de facturation et la fin de la période de facturation.

In [1505]:
df['BEGIN'] = pd.to_datetime(df['BEGIN'], format='%d/%m/%Y', errors='coerce')

In [1506]:
df['END'] = pd.to_datetime(df['END'],format='%d/%m/%Y', errors='coerce')

In [1507]:
df.tail()

      SITE_NAME      BEGIN        END KWH_PERIOD PERIOD_EUR
51427    0632KO 2019-08-30 2019-12-31      3 028     397,18
51428    0632KO 2020-01-01 2020-03-31      2 163     283,57
51429    0632KO 2020-04-01 2020-06-30      2 160     312,55
51430    0632KO 2020-07-01 2020-09-30      2 230     294,07
51431    1203KO 2019-09-27 2019-12-31      4 745     681,96

In [1508]:
df['DAY_OF_CONSOM'] = (df['END'] - df['BEGIN']).dt.days

In [1509]:
df.head()

  SITE_NAME      BEGIN        END KWH_PERIOD PERIOD_EUR  DAY_OF_CONSOM
0    0001BB 2018-01-01 2018-01-31      2 447     316,46             30
1    0001BB 2018-02-01 2018-02-28      2 211     286,82             27
2    0001BB 2018-03-01 2018-03-31      2 450     317,32             30
3    0001BB 2018-04-01 2018-04-30      2 431     315,00             29
4    0001BB 2018-05-01 2018-05-31      2 574     333,37             30

In [1510]:
df.tail()

      SITE_NAME      BEGIN        END KWH_PERIOD PERIOD_EUR  DAY_OF_CONSOM
51427    0632KO 2019-08-30 2019-12-31      3 028     397,18            123
51428    0632KO 2020-01-01 2020-03-31      2 163     283,57             90
51429    0632KO 2020-04-01 2020-06-30      2 160     312,55             90
51430    0632KO 2020-07-01 2020-09-30      2 230     294,07             91
51431    1203KO 2019-09-27 2019-12-31      4 745     681,96             95

In [1511]:
df["KWH_PERIOD"].dtype

dtype('O')

In [1512]:
df['KWH_PERIOD'] = pd.to_numeric(df['KWH_PERIOD'].str.replace(' ', ''))

In [1513]:
df["KWH_PERIOD"].dtype 
df["DAY_OF_CONSOM"].dtype

dtype('int64')

In [1514]:
df['CONSOM_PER_DAY' ]= df['KWH_PERIOD'] / df['DAY_OF_CONSOM']

In [1515]:
df.head()

,SITE_NAME,BEGIN,END,KWH_PERIOD,PERIOD_EUR,DAY_OF_CONSOM,CONSOM_PER_DAY
0,0001BB,2018-01-01,2018-01-31,2447,"316,46",30,81.566667
1,0001BB,2018-02-01,2018-02-28,2211,"286,82",27,81.888889
2,0001BB,2018-03-01,2018-03-31,2450,"317,32",30,81.666667
3,0001BB,2018-04-01,2018-04-30,2431,"315,00",29,83.827586
4,0001BB,2018-05-01,2018-05-31,2574,"333,37",30,85.800000

In [1516]:
# Arrondir à 2 chiffres avec la fonction round()
df['CONSOM_PER_DAY' ] = round(df['CONSOM_PER_DAY' ],2)

#### 4) A partir de cette nouvelle colonne, crée une autre colonne qui nous donne la consommation journalière moyenne de la période.

In [1517]:
df.head()

,SITE_NAME,BEGIN,END,KWH_PERIOD,PERIOD_EUR,DAY_OF_CONSOM,CONSOM_PER_DAY
0,0001BB,2018-01-01,2018-01-31,2447,"316,46",30,81.57
1,0001BB,2018-02-01,2018-02-28,2211,"286,82",27,81.89
2,0001BB,2018-03-01,2018-03-31,2450,"317,32",30,81.67
3,0001BB,2018-04-01,2018-04-30,2431,"315,00",29,83.83
4,0001BB,2018-05-01,2018-05-31,2574,"333,37",30,85.80

#### 5) Merci d'ajouter également une colonne qui donne, pour chaque antenne, le nombre de factures dont on dispose au total. Pas grave si l'information se répète à chaque ligne pour une même antenne.

In [1518]:
df['BILLS'] = df.groupby(['SITE_NAME'])['SITE_NAME'].transform('count')

In [1519]:
df.head()

,SITE_NAME,BEGIN,END,KWH_PERIOD,PERIOD_EUR,DAY_OF_CONSOM,CONSOM_PER_DAY,BILLS
0,0001BB,2018-01-01,2018-01-31,2447,"316,46",30,81.57,35
1,0001BB,2018-02-01,2018-02-28,2211,"286,82",27,81.89,35
2,0001BB,2018-03-01,2018-03-31,2450,"317,32",30,81.67,35
3,0001BB,2018-04-01,2018-04-30,2431,"315,00",29,83.83,35
4,0001BB,2018-05-01,2018-05-31,2574,"333,37",30,85.80,35

#### 6) Et information bonus si tu y arrives : les équipes aimeraient beaucoup avoir une liste de toutes les antennes avec, pour chaque antenne, le coefficient de variation de la consommation. Cela permettra d'avoir une idée, pour chaque antenne, de la dispersion de sa consommation d'énergie.

#### 7) Enfin, tu dois exporter ces deux fichiers obtenus pour pouvoir l'envoyer aux équipes de l'opérateur et leur demander si c'est bien cela qu'ils attendaient de toi.

In [1526]:
Invoices_clean = pd.DataFrame.to_csv(df)

In [1527]:
df.to_csv(r'/Users/rodelin/Documents/THP/Invoices_clean.csv', index = False)